/*!
 * Distpicker v1.0.4
 * https://github.com/fengyuanchen/distpicker
 *
 * Copyright (c) 2014-2016 Fengyuan Chen
 * Released under the MIT license
 *
 * Date: 2016-06-01T15:05:52.606Z
 */

(function (factory) {
  if (typeof define === 'function' && define.amd) {
    // AMD. Register as anonymous module.
    define('ChineseDistricts', [], factory);
  } else {
    // Browser globals.
    factory();
  }
})(function () {

  var ChineseDistricts = {
    86: {
      110000: '业务规划',
      120000: '业务运营',
      130000: '业务推广',
      140000: '业务执行',
    },
    110000: {
      110100: '宏观规划',
      110200: '业务目标',
      110300: '基础配备',
      110400: '流程设计'
    },
    // 110100: {
    //   110101: '东城区',
    //   110102: '西城区',
    //   110105: '朝阳区',
    //   110106: '丰台区',
    //   110107: '石景山区',
    //   110108: '海淀区',
    //   110109: '门头沟区',
    //   110111: '房山区',
    //   110112: '通州区',
    //   110113: '顺义区',
    //   110114: '昌平区',
    //   110115: '大兴区',
    //   110116: '怀柔区',
    //   110117: '平谷区',
    //   110118: '密云区',
    //   110119: '延庆区'
    // },
    120000: {
      120100: '目标分解',
      120200: '绩效制定',
      120300: '流程制定',
      120400: '信息系统',
      120500: '业务管理',
      120600: '业务监控'
    },
    // 120100: {
    //   120101: '和平区',
    //   120102: '河东区',
    //   120103: '河西区',
    //   120104: '南开区',
    //   120105: '河北区',
    //   120106: '红桥区',
    //   120110: '东丽区',
    //   120111: '西青区',
    //   120112: '津南区',
    //   120113: '北辰区',
    //   120114: '武清区',
    //   120115: '宝坻区',
    //   120116: '滨海新区',
    //   120117: '宁河区',
    //   120118: '静海区',
    //   120225: '蓟县'
    // },
    130000: {
      130100: '设计能力',
      130200: '全员营销',
      130300: '展厅营销',
      130400: '活动营销',
      130500: '媒体推广',
      130600: '基盘推广'
    },
    140000: {
      140100: '车辆收购',
      140200: '整备翻新',
      140300: '车辆展示',
      140400: '车辆销售',
      140500: '客户维系'
    },
    140100: {
      140105: '客户接待',
      140106: '车辆评估',
      140107: '报价商谈',
      140108: '车辆收购',
      140109: '客户回访',
      140110: '直接收购',
      140121: '渠道采购'
    },
    140400: {
      140402: '获取客户',
      140403: '展厅接待',
      140411: '需求分析',
      140412: '产品介绍',
      140421: '报价商谈',
      140422: '试乘试驾',
      140423: '签约成交',
      140424: '车辆交付',
      140425: '批售'
    }
  };

  if (typeof window !== 'undefined') {
    window.ChineseDistricts = ChineseDistricts;
  }

  return ChineseDistricts;

});
